{
  "settings": {
    "VirtoCommerce.Search.ElasticSearch8": {
      "IndexTotalFieldsLimit": {
        "title": "Maximum number of fields in an index",
        "description": "Specify the maximum number of fields that can be included in an index. Exceeding this limit can result in performance issues. For more details, refer to the Elasticsearch8 documentation: https://www.elastic.co/guide/en/elasticsearch/reference/current/mapping.html#mapping-limit-settings"
      },
      "TokenFilter": {
        "title": "Token filter",
        "description": "Choose the token filter to apply when indexing searchable fields. This requires rebuilding the index"
      },
      "NGramTokenFilter": {
        "MinGram": {
          "title": "Minimum gram length",
          "description": "Specify the minimum number of characters in a gram. This requires rebuilding the index"
        },
        "MaxGram": {
          "title": "Maximum gram length",
          "description": "Specify the maximum number of characters in a gram. This requires rebuilding the index"
        }
      },
      "MinScore": {
        "title": "Minimum score",
        "description": "Specify the minimum score a document must have to be considered a match. Documents with scores below this threshold will not be included in the results. Set to 0 to return all documents. Applies when keyword is specified"
      },
      "MinScorePerDocumentType": {
        "title": "Minimum score for document type",
        "description": "Specify the minimum score for the specific document type. Documents with scores below this threshold will not be included in the results. Set to 0 to return all documents. Applies when keyword is specified"
      },
      "DeleteDuplicateIndexes": {
        "title": "Deleting duplicate active indexes",
        "description": "Search and delete duplicate active indexes before Delete and build operation"
      },
      "EnableSemanticSearch": {
        "title": "Semantic search activation",
        "description": "Enable/ disable semantic search"
      },
      "SemanticModelId": {
        "title": "Semantic model Id",
        "description": "Make sure that semantic model ID is specified correctly"
      },
      "SemanticPipelineName": {
        "title": "Semantic pipeline name",
        "description": "Make sure that semantic model pipeline name is specified correctly. It produces embeddings generated by the data indexing model"
      },
      "SemanticFieldName": {
        "title": "Semantic field name",
        "description": "Specify semantic model field name. Contains embeddings produced by the semantic pipeline. X.tokens or X.predicted_value"
      },
      "SemanticSearchType": {
        "title": "Semantic model type",
        "description": "Select semantic model type from the list"
      },
      "SemanticVectorModelDimensions": {
        "title": "Vector model dimensions number",
        "description": "Specify the number of dimensions of the third party vector model. Typicaly found in the model description"
      },
      "KeywordBoost": {
        "title": "Boost for keyword search",
        "description": "Specify a floating-point number to adjust the relevance score for documents matching keyword searches. Higher values increase the importance of keyword matches. Defaults to 1.0"
      },
      "SemanticBoost": {
        "title": "Boost for semantic search",
        "description": "Specify a floating-point number to adjust the relevance score for documents matching semantic searches. Higher values increase the importance of semantic matches. Defaults to 1.0"
      }
    }
  }
}
