{
  "settings": {
    "VirtoCommerce.Search.ElasticSearch8": {
      "IndexTotalFieldsLimit": {
        "title": "Максимальное количество полей в индексе",
        "description": "Укажите максимальное количество полей, которые могут быть включены в индекс. Превышение этого лимита может привести к проблемам с производительностью. Подробнее см. в документации Elasticsearch8: https://www.elastic.co/guide/en/elasticsearch/reference/current/mapping.html#mapping-limit-settings"
      },
      "TokenFilter": {
        "title": "Фильтр токенов",
        "description": "Выберите фильтр токенов для применения при индексации полей поиска. Это требует перестройки индекса"
      },
      "NGramTokenFilter": {
        "MinGram": {
          "title": "Минимальная длина n-граммы",
          "description": "Укажите минимальное количество символов в n-грамме. Это требует перестройки индекса"
        },
        "MaxGram": {
          "title": "Максимальная длина n-граммы",
          "description": "Укажите максимальное количество символов в n-грамме. Это требует перестройки индекса"
        }
      },
      "MinScore": {
        "title": "Минимальный балл",
        "description": "Укажите минимальный балл, который документ должен иметь, чтобы считаться релевантным. Документы с баллом ниже этого порога не будут включены в результаты. Установите значение 0, чтобы включить все документы. Применяется, если указано ключевое слово"
      },
      "MinScorePerDocumentType": {
        "title": "Минимальный балл для типа документа",
        "description": "Укажите минимальный балл для конкретного типа документа. Документы с баллом ниже этого порога не будут включены в результаты. Установите значение 0, чтобы включить все документы. Применяется, если указано ключевое слово"
      },
      "DeleteDuplicateIndexes": {
        "title": "Удаление дублирующихся активных индексов",
        "description": "Найдите и удалите дублирующиеся активные индексы перед операцией удаления и создания"
      },
      "EnableSemanticSearch": {
        "title": "Включение семантического поиска",
        "description": "Включить/выключить семантический поиск"
      },
      "SemanticModelId": {
        "title": "Идентификатор семантической модели",
        "description": "Убедитесь, что идентификатор семантической модели указан правильно"
      },
      "SemanticPipelineName": {
        "title": "Имя конвейера семантической модели",
        "description": "Убедитесь, что имя конвейера семантической модели указано правильно. Создает векторы, генерируемые моделью индексации данных"
      },
      "SemanticFieldName": {
        "title": "Имя семантического поля",
        "description": "Укажите имя семантического поля модели. Содержит векторы, созданные семантическим конвейером. X.tokens или X.predicted_value"
      },
      "SemanticSearchType": {
        "title": "Тип семантической модели",
        "description": "Выберите тип семантической модели из списка"
      },
      "SemanticVectorModelDimensions": {
        "title": "Количество измерений векторной модели",
        "description": "Укажите количество измерений в векторной модели стороннего поставщика. Обычно указывается в описании модели"
      },
      "KeywordBoost": {
        "title": "Повышение релевантности для поиска по ключевым словам",
        "description": "Укажите число с плавающей точкой для корректировки оценки релевантности документов, соответствующих поиску по ключевым словам. Более высокие значения увеличивают значимость совпадений по ключевым словам. Значение по умолчанию: 1.0"
      },
      "SemanticBoost": {
        "title": "Повышение релевантности для семантического поиска",
        "description": "Укажите число с плавающей точкой для корректировки оценки релевантности документов, соответствующих семантическому поиску. Более высокие значения увеличивают значимость семантических совпадений. Значение по умолчанию: 1.0"
      }
    }
  }
}